Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:CatalogRef.Specifications</v8:Type>
						<v8:Type>cfg:DocumentRef.FixedAssetsDepreciation</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
						<v8:Type>cfg:CatalogRef.CustomerInvoiceNoteAttachedFiles</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoiceNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.Event</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryReconciliation</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoanDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DigitallySigned</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullDescr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsEditing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFileModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionPathToFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDataMoved</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIDReceiverObject</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Files/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Event data processor BeforeWrite.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If AdditionalProperties.Property("FileConversion") Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(FileOwner) Then
		
		ErrorDescription = StringFunctionsClientServer.PlaceParametersIntoString(
			NStr("en = 'Owner in file is
			           |not filled in ""%1"".'"),
			Description);
		
		If InfobaseUpdate.InfobaseUpdateInProgress() Then
			
			WriteLogEvent(
				NStr("en = 'Files. File record error at IB update'",
				     CommonUseClientServer.MainLanguageCode()),
				EventLogLevel.Error,
				,
				Ref,
				ErrorDescription);
		Else
			Raise ErrorDescription;
		EndIf;
		
	EndIf;
	
	If IsNew() Then
		// Check right "Adding".
		If Not FileOperationsService.IsRight("FilesAdd", FileOwner) Then
			Raise StringFunctionsClientServer.PlaceParametersIntoString(
				NStr("en = 'The rights are not sufficient to add the file into folder ""%1"".'"),
				String(FileOwner));
		EndIf;
	Else
		
		HasDeletionMarkInInfobase = DeletionMarkInIB();
		DeletionMarkIsMarked = DeletionMark AND Not HasDeletionMarkInInfobase;
		DeletionMarkChanged = (DeletionMark <> HasDeletionMarkInInfobase);
		
		DigitallySignedObjectRecord = False;
		If AdditionalProperties.Property("DigitallySignedObjectRecord") Then
			DigitallySignedObjectRecord = AdditionalProperties.DigitallySignedObjectRecord;
		EndIf;	
		
		// Allow to put deletion mark on a signed file.
		If Not PrivilegedMode() AND DigitallySignedObjectRecord <> True AND Not DeletionMarkIsMarked Then
			
			If ValueIsFilled(Ref) Then
				
				AttributesStructure = CommonUse.ObjectAttributesValues(Ref, "DigitallySigned, Encrypted");
				RefDigitallySigned = AttributesStructure.DigitallySigned;
				RefEncrypted = AttributesStructure.Encrypted;
				
				If DigitallySigned AND RefDigitallySigned Then
					Raise NStr("en = 'DigitallySigned file can not be edited.'");
				EndIf;	
				
				If Encrypted AND RefEncrypted AND DigitallySigned AND Not RefDigitallySigned Then
					Raise NStr("en = 'Encrypted file can not be signed.'");
				EndIf;	
				
			EndIf;	
			
		EndIf;	
		
		If Not CurrentVersion.IsEmpty() Then
			
			CurrentVersionAttributes = CommonUse.ObjectAttributesValues(
				CurrentVersion, "FullDescr");
			
			// Check attachment file name equality and its current version.
			// If the names are different - version name must be the same as of the card with file.
			If CurrentVersionAttributes.FullDescr <> FullDescr Then
				Object = CurrentVersion.GetObject();
				If Object <> Undefined AND Object.Ref <> Undefined Then
					LockDataForEdit(Object.Ref);
					SetPrivilegedMode(True);
					Object.FullDescr = FullDescr;
					// IN order to prevent the CopyFileVersionAttributesToFile subscription from activiation.
					Object.AdditionalProperties.Insert("FileRenaming", True);
					Object.Write();
					SetPrivilegedMode(False);
				EndIf;
			EndIf;
			
		EndIf;
		
		If DeletionMarkChanged Then
			
			// Check right "Deletion mark".
			If Not FileOperationsService.IsRight("FileDeletionMark", FileOwner) Then
				Raise StringFunctionsClientServer.PlaceParametersIntoString(
					NStr("en = 'The rights are not sufficient to mark the file for deletion in folder ""%1"".'"),
					String(FileOwner));
			EndIf;
			
			// Try set deletion mark.
			If DeletionMarkIsMarked AND Not IsEditing.IsEmpty() Then
				Raise StringFunctionsClientServer.PlaceParametersIntoString(
					NStr("en = 'Cannot delete
					           |file ""%1"", so. it is locked for editing by user ""%2"".'"),
					FullDescr,
					String(IsEditing) );
			EndIf;
			
		EndIf;
		
		VIBDescription = VIBDescription();
		If FullDescr <> VIBDescription Then 
			If Not IsEditing.IsEmpty() Then
				Raise StringFunctionsClientServer.PlaceParametersIntoString(
					NStr("en = 'File can not be
					           |renamed ""%1"", so. it is locked for editing by user ""%2"".'"),
					VIBDescription,
					String(IsEditing));
			EndIf;
		EndIf;
		
	EndIf;
	
	Description = TrimAll(FullDescr);
	
EndProcedure

Procedure Filling(FillingData, StandardProcessing)
	
	If IsNew() Then
		CreationDate = CurrentSessionDate();
		StoreVersions = True;
		PictureIndex = FileFunctionsServiceClientServer.GetFileIconIndex(Undefined);
		
		Author = Users.CurrentUser();
	EndIf;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// Returns the current value of the deletion mark in infobase.
Function DeletionMarkInIB()
	Query = New Query;
	Query.Text = 
		"SELECT
		|	Files.DeletionMark
		|FROM
		|	Catalog.Files AS Files
		|WHERE
		|	Files.Ref = &Ref";

	Query.SetParameter("Ref", Ref);

	Result = Query.Execute();

	If Not Result.IsEmpty() Then
		Selection = Result.Select();
		Selection.Next();
		Return Selection.DeletionMark;
	EndIf;	
	
	Return Undefined;
EndFunction

// Returns the current description value in infobase.
Function VIBDescription()
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Files.FullDescr
	|FROM
	|	Catalog.Files AS Files
	|WHERE
	|	Files.Ref = &Ref";
	
	Query.SetParameter("Ref", Ref);
	Result = Query.Execute();
	
	If Not Result.IsEmpty() Then
		Selection = Result.Select();
		Selection.Next();
		Return Selection.FullDescr;
	EndIf;
	
	Return Undefined;	
	
EndFunction

#EndRegion

#EndIf
